{
  "backend/main.mo": "Actor defines binder, photocard, and user data types with storage, authorization mixins, and functions for managing binders, cards, profiles, and subscription status.",
  "feature_evidence.json": "Feature evidence report listing GoodNotes‑optimized PDF export features, related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file across auth, binder screens, hooks, components, and styling.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions for light and dark themes using OKLCH colors and shared utility styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile loading, global layout, and navigation between binder screens.",
  "frontend/src/components/binder/BinderFrame.tsx": "UI wrapper rendering the visual binder page with textured background and frame elements.",
  "frontend/src/components/binder/BinderPageExportCanvas.tsx": "Export‑only 12‑card grid renderer that draws photocard images with rarity, condition, glint overlays, and no UI chrome.",
  "frontend/src/components/binder/BinderPdfExportDialog.tsx": "Dialog for exporting a binder page as a PDF with page size and quality options, handling generation state and errors.",
  "frontend/src/components/binder/BinderRingsOverlay.tsx": "Displays a static semi-transparent binder rings image overlay positioned on the left side.",
  "frontend/src/components/binder/PageSwipeContainer.tsx": "Container enabling swipe gestures and page-flip animations based on navigation direction.",
  "frontend/src/components/layout/AccentColorSelector.tsx": "Dropdown selector allowing users to choose an accent color theme previewed with small swatches.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, footer, user profile display, accent selector, and logout handling.",
  "frontend/src/components/system/GlobalLoadingGate.tsx": "Gate component showing a loading spinner or error state with retry before rendering app content.",
  "frontend/src/config/buildInfo.ts": "Exports static deployment build metadata including ID and timestamp.",
  "frontend/src/config/subscription.ts": "Provides helpers to read and check configuration of the Shopify upgrade URL from environment variables.",
  "frontend/src/features/auth/LoginPanel.tsx": "Login screen using Internet Identity with accent initialization and a sign‑in button.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter a display name and save their profile.",
  "frontend/src/features/binders/theme.ts": "Returns the default binder theme with preset colors, textures, and styles.",
  "frontend/src/features/cards/editedImageCache.ts": "LocalStorage utilities for saving, retrieving, and clearing edited card images.",
  "frontend/src/features/cards/imageValidation.ts": "Validates uploaded card images for allowed file types and max size.",
  "frontend/src/features/cards/overlayAssets.ts": "Maps card condition and rarity to sticker and badge asset paths and provides glint overlay logic.",
  "frontend/src/features/editor/stickerTray.ts": "Defines sticker metadata and loads sticker images from a sprite sheet for the editor.",
  "frontend/src/features/export/binderPagePdf.ts": "Generates a printable HTML page for exporting a binder page as PDF, resolving images and opening a print window.",
  "frontend/src/features/export/resolveExportImages.ts": "Converts card image blobs to data URLs and preloads overlay assets for reliable PDF export.",
  "frontend/src/features/export/shareOrDownloadPdf.ts": "Provides logging and filename generation for sharing or saving PDFs via the browser print dialog.",
  "frontend/src/hooks/useAccentColor.ts": "Manages accent color selection, persists it in localStorage, and applies CSS variable overrides.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBinderPagination.ts": "Handles pagination logic for binder cards, exposing current page, navigation, and sliced card lists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, initialization, and context management using Dfinity AuthClient.",
  "frontend/src/hooks/useLoadingDiagnostics.ts": "Logs delayed loading diagnostics to identify which app step is blocking without exposing sensitive data.",
  "frontend/src/hooks/useQueries.ts": "Wrapper hooks for backend queries and mutations, handling user profile, binders, subscription status, and card actions.",
  "frontend/src/hooks/useSwipeGesture.ts": "Provides touch and mouse handlers to detect horizontal swipe gestures with configurable callbacks.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive custom color variables and utility classes for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/screens/AddCardScreen.tsx": "UI for adding a new photocard including file validation, preview, upload progress, and submit handling.",
  "frontend/src/screens/BinderLibraryScreen.tsx": "Displays the user's binders with create/delete actions, subscription limits, error handling, and upgrade prompts.",
  "frontend/src/screens/BinderSettingsScreen.tsx": "Allows customizing a binder's theme including colors, textures, and styles, and saving updates.",
  "frontend/src/screens/BinderViewScreen.tsx": "Shows a binder's pages with pagination, drag-and-drop card reordering, and export/settings controls.",
  "frontend/src/screens/EditCardScreen.tsx": "React screen for editing a card image with stickers on a canvas, handling rendering, selection, dragging, and saving overlays.",
  "frontend/src/utils/backendErrorMessages.ts": "Normalizes backend errors into user-friendly messages with special handling for binder limit errors.",
  "frontend/src/utils/promiseTimeout.ts": "Provides a helper to wrap any promise with a timeout using Promise.race.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters and session-stored values across navigation.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, fonts, shadows, and animations for the binder-themed UI.",
  "project_state.json": "Project metadata describing current features and requirements for GoodNotes‑optimized PDF export and sharing."
}