{
  "backend/main.mo": "Defines Motoko canister with access control, blob storage mixins, user profiles, binders, photocards, and CRUD-style binder/card operations.",
  "feature_evidence.json": "Lists implemented features with associated source files, components, tests, and confidence for build verification.",
  "frontend-file-summaries.txt": "Provides short human-written summaries for all major frontend files related to auth, binders, cards, and UI theming.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light/dark theming and scrapbook-style colors.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main app component handling authentication flow, profile setup, navigation, and screen rendering.",
  "frontend/src/components/layout/AppLayout.tsx": "App-wide layout with header, user info, logout handling, and footer.",
  "frontend/src/features/auth/LoginPanel.tsx": "Internet Identity login screen with branding and sign‑in button.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Modal component that collects a user's display name and saves it via a profile mutation.",
  "frontend/src/features/binders/theme.ts": "Provides a function returning the default binder theme configuration.",
  "frontend/src/features/cards/editedImageCache.ts": "LocalStorage helpers for saving, retrieving, and clearing edited card images.",
  "frontend/src/features/cards/imageValidation.ts": "Validates uploaded image files for type and size limits.",
  "frontend/src/features/editor/stickerTray.ts": "Defines sticker types and loads sticker images from a sprite sheet for the editor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook managing Internet Identity login, state, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, binders, cards, and related mutations.",
  "frontend/src/index.css": "Tailwind base styles and custom scrapbook-themed color variables and utilities.",
  "frontend/src/main.tsx": "App entrypoint initializing React Query and Internet Identity providers before rendering.",
  "frontend/src/screens/AddCardScreen.tsx": "UI for adding a photocard, handling file validation, preview, and upload via useAddPhotocard with progress updates.",
  "frontend/src/screens/BinderLibraryScreen.tsx": "Displays the list of binders and provides creation and deletion dialogs using related query hooks.",
  "frontend/src/screens/BinderSettingsScreen.tsx": "Allows customizing a binder’s theme and saving changes using useUpdateBinderTheme.",
  "frontend/src/screens/BinderViewScreen.tsx": "Shows a binder’s cards with drag‑and‑drop reordering and navigation to add, edit, or customize the binder.",
  "frontend/src/screens/EditCardScreen.tsx": "Provides a canvas-based editor for adding, moving, and saving stickers on a photocard image.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state, features, and required assets for a photocard binder app including uploads, editing, theming, and UI screens."
}