{
  "backend/main.mo": "Motoko canister defining user binders, photocards, themes, authorization, and subscription status with CRUD utilities.",
  "feature_evidence.json": "Feature evidence metadata listing feature IDs, related files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files used for reference in build planning.",
  "frontend/index.css": "Global Tailwind CSS variables and theming for light and dark modes using OKLCH colors.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup, screen routing, and accent color initialization.",
  "frontend/src/components/binder/BinderFrame.tsx": "Visual frame component rendering a binder-style page with textures and theming support.",
  "frontend/src/components/binder/BinderRingsOverlay.tsx": "Static overlay component showing binder rings graphic on the page.",
  "frontend/src/components/binder/PageSwipeContainer.tsx": "Wrapper adding swipe gesture handling and page‑flip animations for paginated views.",
  "frontend/src/components/layout/AccentColorSelector.tsx": "UI dropdown for choosing accent colors using a predefined palette and the accent‑color hook.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper with header, footer, user display, accent selector, and logout handling.",
  "frontend/src/config/subscription.ts": "Reads and validates the Shopify upgrade URL from environment variables.",
  "frontend/src/features/auth/LoginPanel.tsx": "Login screen using Internet Identity with accent initialization and sign‑in UI.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Modal for initial profile setup that saves a user’s display name.",
  "frontend/src/features/binders/theme.ts": "Provides a default binder theme configuration object.",
  "frontend/src/features/cards/editedImageCache.ts": "LocalStorage helpers for saving, retrieving, and clearing edited card images.",
  "frontend/src/features/cards/imageValidation.ts": "Validates image uploads by checking type and enforcing a 10MB size limit.",
  "frontend/src/features/editor/stickerTray.ts": "Defines sticker metadata and loads sticker images from a sprite sheet.",
  "frontend/src/hooks/useAccentColor.ts": "Manages user‑selected accent color and applies CSS custom property overrides.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useBinderPagination.ts": "Provides pagination state and helpers for photocard arrays.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity, and status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, subscription status, binders, and photocards through an actor API.",
  "frontend/src/hooks/useSwipeGesture.ts": "Implements swipe detection logic for touch and mouse events, exposing handler callbacks for left and right swipes.",
  "frontend/src/index.css": "Configures Tailwind layers and extensive theme variables for light and dark modes, including custom scrapbook and binder color utilities.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/screens/AddCardScreen.tsx": "UI for uploading and validating a photocard, handling file preview, progress, and submission via useAddPhotocard.",
  "frontend/src/screens/BinderLibraryScreen.tsx": "Displays the user's binder list with subscription-based limits and supports creating and deleting binders.",
  "frontend/src/screens/BinderSettingsScreen.tsx": "Provides a UI to customize a binder’s theme and saves changes through useUpdateBinderTheme.",
  "frontend/src/screens/BinderViewScreen.tsx": "Displays a binder’s cards with pagination and supports drag‑and‑drop reordering, updating backend order and handling navigation actions.",
  "frontend/src/screens/EditCardScreen.tsx": "Provides a canvas-based card editor allowing sticker placement, manipulation, and saving edited images.",
  "frontend/src/utils/backendErrorMessages.ts": "Normalizes backend errors into user‑friendly messages, with special handling for binder limit errors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugins for the frontend UI.",
  "project_state.json": "Contains metadata, features, and pending requests related to subscription handling and Shopify integration."
}