{
  "backend/main.mo": "Main backend actor with user data management (binders, photocards, profiles), subscription status tracking, admin content settings (logo, background, terms, master admin key), Stripe integration, access control via MixinAuthorization, blob storage via MixinStorage, and migration support.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with a run function to transform state during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting implemented admin portal features including master admin key verification, user oversight table with search and binder viewing, content management, and layout customization.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including authentication, binder management, card editing, admin portal, layout components, hooks, and utilities with soft beige theming throughout.",
  "frontend/.env.example": "Example environment variables file noting that master admin key is now backend-stored and should not be added to frontend env files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, including sidebar, chart, and UI component color definitions.",
  "frontend/index.html": "HTML entry point with viewport meta tag and descriptive title for the digital photocard binder application.",
  "frontend/src/App.tsx": "Main app component managing authentication flow, profile setup, screen-based navigation (library, binder, add/edit card, settings, admin), superuser access control for /admin-portal route, global alerts, and loading states with error handling.",
  "frontend/src/components/binder/BinderFrame.tsx": "Binder page frame component with spine decoration, customizable theme (background, accent, pattern), admin-configurable background image override, and texture overlay effects.",
  "frontend/src/components/binder/BinderPageExportCanvas.tsx": "Renders a chrome-free 12-card binder page grid (1200×1600px) for export, displaying photocard images with condition stickers, rarity badges, glint overlays, and quantity indicators.",
  "frontend/src/components/binder/BinderPdfExportDialog.tsx": "Dialog component for exporting a binder page as a PDF with configurable page size (A4/Letter) and quality settings, targeting GoodNotes compatibility.",
  "frontend/src/components/binder/BinderRingsOverlay.tsx": "Displays a decorative binder rings overlay image positioned on the left side of the page.",
  "frontend/src/components/binder/PageSwipeContainer.tsx": "Container component that handles swipe gestures for page navigation and animates page transitions with left/right flip animations.",
  "frontend/src/components/layout/AccentColorSelector.tsx": "Dropdown selector for choosing app accent colors (coral, sage, lavender, rose, teal) with color preview swatches.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header containing logo, accent color selector, admin button (for superusers), profile settings, logout, and optional global alert banner.",
  "frontend/src/components/system/GlobalLoadingGate.tsx": "Global loading and error boundary component that displays loading spinner, error state with retry button, or renders children based on loading/error state.",
  "frontend/src/components/terms/TermsAndConditionsDialog.tsx": "Modal dialog that fetches and displays terms and conditions content from admin settings in a scrollable area.",
  "frontend/src/config/admin.ts": "Defines superuser email allowlist and provides function to check if an email has admin portal access.",
  "frontend/src/config/buildInfo.ts": "Exports build metadata including deployment ID and timestamp for deployment tracking.",
  "frontend/src/config/subscription.ts": "Provides functions to retrieve and validate the Shopify upgrade URL from environment variables for subscription management.",
  "frontend/src/features/admin/AdminUserBinderReadOnlyDialog.tsx": "A read-only dialog component that displays all binders and cards for a specific user principal, fetched via useGetBindersByUser hook. Shows loading states, error handling with retry, and renders binder cards in a scrollable grid layout.",
  "frontend/src/features/admin/ContentManagerPanel.tsx": "Admin panel for managing site content settings including Terms & Conditions text and Master Admin Key updates. Requires unlock state and uses mutations to persist changes with toast notifications for success/error feedback.",
  "frontend/src/features/admin/LayoutPresetsPanel.tsx": "Admin panel for managing grid layout presets (e.g., '3x3', '4x3') and setting the default layout for new users. Validates preset format, allows adding/removing presets, and requires admin unlock state.",
  "frontend/src/features/admin/MasterAdminKeyGate.tsx": "Authentication gate component that verifies Master Admin Key before granting access to admin features. Includes 30-minute inactivity timeout with activity tracking and auto-locks by reloading the page on timeout.",
  "frontend/src/features/admin/PaymentSettingsPanel.tsx": "Admin panel for configuring Stripe payment integration by saving publishable and secret keys. Validates key formats (pk_ and sk_ prefixes) and stores them securely in encrypted canister storage.",
  "frontend/src/features/admin/UsersPanel.tsx": "Admin panel component for viewing and managing all users, including search by email, subscription status updates, and viewing user binders. Requires admin unlock to access.",
  "frontend/src/features/auth/LoginPanel.tsx": "Login screen component that displays the app branding and a button to sign in using Internet Identity authentication.",
  "frontend/src/features/auth/ProfileSettingsDialog.tsx": "Dialog component for users to update their profile information (display name, email) and select their preferred binder layout from available presets.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "First-time user onboarding modal that collects the user's name and optional email address to create their profile.",
  "frontend/src/features/binders/theme.ts": "Exports a function that returns the default binder theme configuration including colors, textures, and styling options.",
  "frontend/src/features/cards/editedImageCache.ts": "Utility functions for storing, retrieving, and clearing edited card images in browser localStorage using a cache prefix.",
  "frontend/src/features/cards/imageValidation.ts": "Validates uploaded image files by checking file type (PNG/JPEG) and size (max 10MB), returning validation results with error messages.",
  "frontend/src/features/cards/overlayAssets.ts": "Maps card condition and rarity enums to their corresponding sticker/badge asset paths, and provides utilities for holographic glint overlays on legendary cards.",
  "frontend/src/features/editor/stickerTray.ts": "Defines sticker types and loads individual sticker images from a sprite sheet for use in the card editor.",
  "frontend/src/features/export/binderPagePdf.ts": "Generates PDF exports of binder pages using browser print functionality, resolving card images to data URLs and building print-optimized HTML with configurable page sizes.",
  "frontend/src/features/export/resolveExportImages.ts": "Provides utilities to convert image blobs to data URLs for PDF export, resolve edited or original card images from cache, and preload overlay assets used in binder pages.",
  "frontend/src/features/export/shareOrDownloadPdf.ts": "Provides a function to initiate PDF export via browser print API and generates sanitized filenames for binder page exports.",
  "frontend/src/hooks/useAccentColor.ts": "Custom hook that manages accent color theme selection (coral, sage, lavender, rose, teal) with localStorage persistence and CSS variable updates.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBinderPagination.ts": "Custom hook that handles pagination logic for photocard binders, providing current page cards and navigation functions with extensive debug logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useLoadingDiagnostics.ts": "Custom hook that logs detailed diagnostic information when app loading exceeds a threshold, helping identify which initialization step is blocking without exposing sensitive data.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including binders CRUD, photocard management, user profile, subscription status, and admin functions with timeout handling.",
  "frontend/src/hooks/useSwipeGesture.ts": "Custom hook that detects horizontal swipe gestures on both touch and mouse events, triggering callbacks when swipe threshold is exceeded.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a scrapbook/binder theme including light/dark modes, color palettes (cream, peach, sage, coral, charcoal), and utility classes for styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/screens/AddCardScreen.tsx": "Screen component for adding a new photocard to a binder with image upload, validation, preview, progress tracking, and form submission using ExternalBlob for file handling.",
  "frontend/src/screens/AdminAccessDeniedScreen.tsx": "Simple error screen displayed when a user attempts to access the admin dashboard without proper permissions, with a back button to return to the library.",
  "frontend/src/screens/AdminDashboardScreen.tsx": "Admin dashboard with tabbed interface for content management, user oversight, layout options, and payment settings, protected by MasterAdminKeyGate authentication.",
  "frontend/src/screens/BinderLibraryScreen.tsx": "Main library screen displaying user's binders with create/delete functionality, subscription status checking (free vs pro), binder limits enforcement, and Shopify upgrade integration.",
  "frontend/src/screens/BinderSettingsScreen.tsx": "Settings screen for customizing binder theme properties including cover color, texture, page background, card frame style, text color, accent color, border style, and background pattern.",
  "frontend/src/screens/BinderViewScreen.tsx": "Main binder viewing screen that displays paginated photocard collections in a grid layout, with navigation controls, card editing, settings access, and error/loading states.",
  "frontend/src/screens/EditCardScreen.tsx": "React component for editing card images with sticker overlays, supporting drag-and-drop positioning, rotation, scaling, and deletion of stickers on a canvas.",
  "frontend/src/utils/backendErrorMessages.ts": "Utility for normalizing backend errors into user-friendly messages, specifically handling binder limit errors with plan-specific upgrade hints.",
  "frontend/src/utils/normalizeEmail.ts": "Utility functions for normalizing email addresses (trim and lowercase) and comparing them in a case-insensitive manner.",
  "frontend/src/utils/promiseTimeout.ts": "Wraps promises with a configurable timeout (default 30s) to prevent indefinite hanging by racing against a timeout rejection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, binder-themed design tokens, custom animations for page flips, and typography plugin.",
  "project_state.json": "Project metadata documenting a card collection management app with admin portal, authentication, binder customization, and subscription features including implemented features and architectural notes."
}