{
  "backend/main.mo": "Motoko canister defining user access control, subscription status, binders, cards, and storage logic with admin-gated subscription updates.",
  "feature_evidence.json": "Feature evidence report describing required sticker-generation features and static asset integration.",
  "frontend-file-summaries.txt": "List of prewritten summaries for all frontend source files used for build planning.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables for light and dark modes with global styling.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app handling authentication, profile loading, navigation, and screen rendering.",
  "frontend/src/components/binder/BinderFrame.tsx": "UI component rendering a textured binder page frame with optional theme overrides.",
  "frontend/src/components/binder/BinderRingsOverlay.tsx": "Overlay component displaying binder rings graphic for visual realism.",
  "frontend/src/components/binder/PageSwipeContainer.tsx": "Container enabling swipe gestures and animated page-flip transitions between pages.",
  "frontend/src/components/layout/AccentColorSelector.tsx": "Selector component allowing users to change the global accent color from preset options.",
  "frontend/src/components/layout/AppLayout.tsx": "No summary available.",
  "frontend/src/components/system/GlobalLoadingGate.tsx": "No summary available.",
  "frontend/src/config/buildInfo.ts": "No summary available.",
  "frontend/src/config/subscription.ts": "No summary available.",
  "frontend/src/features/auth/LoginPanel.tsx": "No summary available.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "No summary available.",
  "frontend/src/features/binders/theme.ts": "No summary available.",
  "frontend/src/features/cards/editedImageCache.ts": "No summary available.",
  "frontend/src/features/cards/imageValidation.ts": "No summary available.",
  "frontend/src/features/editor/stickerTray.ts": "No summary available.",
  "frontend/src/hooks/useAccentColor.ts": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useBinderPagination.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useLoadingDiagnostics.ts": "React hook that logs delayed loading diagnostics based on state and a timeout threshold.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, binders, subscriptions, and photocards through the backend actor.",
  "frontend/src/hooks/useSwipeGesture.ts": "Hook providing touch and mouse handlers to detect left and right swipe gestures with a threshold.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and custom color utility classes.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/screens/AddCardScreen.tsx": "UI screen for uploading a photocard with validation, preview, and progress-driven upload via useAddPhotocard.",
  "frontend/src/screens/BinderLibraryScreen.tsx": "Screen for listing, creating, and deleting binders, handling subscription limits, errors, and loading diagnostics.",
  "frontend/src/screens/BinderSettingsScreen.tsx": "Screen for editing a binder’s theme settings and saving updates via mutation hooks.",
  "frontend/src/screens/BinderViewScreen.tsx": "Displays binder details and paginated cards with drag‑and‑drop reordering and navigation controls.",
  "frontend/src/screens/EditCardScreen.tsx": "Canvas-based editor for adding, moving, and modifying stickers on a card image before saving.",
  "frontend/src/utils/backendErrorMessages.ts": "Normalizes backend errors into user-friendly messages, including binder limit handling.",
  "frontend/src/utils/promiseTimeout.ts": "Provides a wrapper that adds a timeout to any promise to prevent indefinite waiting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and binder-specific design tokens.",
  "project_state.json": "Tracks project state for generating vintage-style sticker PNG assets, listing schema info, existing features, and required images. Contains no code logic, only configuration and metadata."
}