{
  "backend/main.mo": "Main backend actor defining data types (Binder, Photocard, UserProfile, SubscriptionStatus), user/binder/card management functions, admin content settings, Stripe integration, and access control with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: fixing binder view empty state display, fixing master admin key authentication, and adding error handling/logging for diagnostics.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including screens, hooks, components, and utilities with focus on authentication, binder management, card editing, pagination, and admin features.",
  "frontend/.env.example": "Example environment variables file noting optional Shopify upgrade URL and clarifying that Master Admin Key is now stored backend-side, not in frontend env vars.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light/dark themes, defining design tokens for background, foreground, primary, secondary, accent, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag and descriptive title for the digital photocard binder application, loading React app via main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup, screen-based navigation (library/binder/addCard/editCard/settings/admin), superuser access control for /admin-portal route, global alerts, and loading gates with error handling.",
  "frontend/src/components/binder/BinderFrame.tsx": "Decorative binder frame component with spine/edge styling, custom background support from admin settings, and texture overlay for realistic binder page appearance.",
  "frontend/src/components/binder/BinderPageExportCanvas.tsx": "Chrome-free export component rendering a 12-card grid (1200x1600px) with condition stickers, rarity badges, holographic glints, and quantity badges for binder page image export.",
  "frontend/src/components/binder/BinderPdfExportDialog.tsx": "Dialog component for exporting a binder page as a PDF with configurable page size (A4/Letter) and quality settings, optimized for GoodNotes.",
  "frontend/src/components/binder/BinderRingsOverlay.tsx": "Renders a decorative binder rings overlay image positioned on the left side of the page.",
  "frontend/src/components/binder/PageSwipeContainer.tsx": "Container component that handles swipe gestures for page navigation and animates page transitions with left/right flip effects.",
  "frontend/src/components/layout/AccentColorSelector.tsx": "Dropdown selector for choosing app accent colors (coral, sage, lavender, rose, teal) with color preview swatches.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, user profile, admin access, logout functionality, and global alert display.",
  "frontend/src/components/system/GlobalLoadingGate.tsx": "Global loading and error boundary component that displays loading spinners, error messages with retry functionality, or renders children when ready.",
  "frontend/src/components/terms/TermsAndConditionsDialog.tsx": "Dialog that fetches and displays terms and conditions content from admin settings in a scrollable view.",
  "frontend/src/config/admin.ts": "Defines superuser email allowlist and provides function to check if an email has admin privileges.",
  "frontend/src/config/buildInfo.ts": "Exports build metadata including deployment ID and timestamp for tracking deployments.",
  "frontend/src/config/subscription.ts": "Configuration utilities for retrieving and validating Shopify upgrade URL from environment variables.",
  "frontend/src/features/admin/AdminUserBinderReadOnlyDialog.tsx": "Admin dialog for viewing a user's binder collection in read-only mode, displaying all binders and their cards with loading and error states.",
  "frontend/src/features/admin/ContentManagerPanel.tsx": "Admin panel for managing site content including terms and conditions text, logo, and background images with upload progress tracking. Includes functionality to update the master admin key with validation and confirmation.",
  "frontend/src/features/admin/LayoutPresetsPanel.tsx": "Admin panel for managing layout presets (e.g., \"3x3\", \"4x3\") with validation, add/remove functionality, and setting a default layout. Prevents removal of the currently active default layout.",
  "frontend/src/features/admin/MasterAdminKeyGate.tsx": "Authentication gate component that requires master admin key verification to access admin features. Includes 30-minute inactivity timeout with automatic lock and activity tracking.",
  "frontend/src/features/admin/PaymentSettingsPanel.tsx": "Admin panel for configuring Stripe payment integration by entering and validating publishable and secret keys. Keys are validated for correct format (pk_/sk_ prefixes) before secure storage.",
  "frontend/src/features/admin/UsersPanel.tsx": "Admin panel displaying user analytics with search/filter functionality, subscription status badges, and ability to view individual user binders in read-only mode. Shows user registration dates and subscription tiers.",
  "frontend/src/features/auth/LoginPanel.tsx": "Login screen component using Internet Identity authentication with branded UI including logo, gradient background, and sign-in button. Initializes accent color theming on mount.",
  "frontend/src/features/auth/ProfileSettingsDialog.tsx": "Dialog component for editing user profile (display name, email) and selecting layout presets, with save functionality that updates both profile and layout preferences.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Full-screen modal for initial user profile setup, collecting display name and optional email with a themed welcome interface.",
  "frontend/src/features/binders/theme.ts": "Exports a function that returns the default binder theme configuration including colors, textures, and styling properties.",
  "frontend/src/features/cards/editedImageCache.ts": "Manages localStorage caching of edited card images with save, retrieve, and clear operations using a consistent key prefix.",
  "frontend/src/features/cards/imageValidation.ts": "Validates uploaded image files for type (PNG/JPEG) and size (max 10MB), returning structured validation results.",
  "frontend/src/features/cards/overlayAssets.ts": "Maps card condition and rarity enums to their corresponding asset paths for stickers, badges, and holographic overlays.",
  "frontend/src/features/editor/stickerTray.ts": "Defines sticker types and loads individual stickers from a sprite sheet by extracting regions into separate image elements.",
  "frontend/src/features/export/binderPagePdf.ts": "Generates PDF exports of binder pages using browser print API, preloading assets and resolving card images to data URLs for reliable rendering.",
  "frontend/src/features/export/resolveExportImages.ts": "Converts ExternalBlob objects to data URLs and resolves card images (edited cache or original) for PDF export, with asset preloading utilities.",
  "frontend/src/features/export/shareOrDownloadPdf.ts": "Provides filename generation for PDF exports and logs export initiation (actual save/share handled by browser print dialog).",
  "frontend/src/hooks/useAccentColor.ts": "Custom hook for managing app-wide accent color theme with localStorage persistence and CSS variable updates.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useBinderPagination.ts": "Custom React hook that manages pagination for photocard binders, providing current page state, navigation functions (next/prev/goTo), and sliced card arrays with extensive console logging for debugging.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origins.",
  "frontend/src/hooks/useLoadingDiagnostics.ts": "Diagnostic hook that logs detailed troubleshooting information to the console when app loading exceeds a threshold (default 3s), identifying which step (actor init, profile fetch, binders fetch) is blocking without exposing sensitive data.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data fetching and mutations, including user profiles, binders, subscription status, admin checks, and CRUD operations for photocards with timeout handling and query invalidation.",
  "frontend/src/hooks/useSwipeGesture.ts": "Custom hook that detects horizontal swipe gestures on both touch and mouse events, triggering callbacks for left/right swipes when movement exceeds a configurable threshold while filtering out vertical scrolling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom scrapbook-themed design tokens using OKLCH color space, defining light/dark mode variables for backgrounds, borders, and a soft beige binder aesthetic with coral/sage accent colors.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component wrapped in QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication context.",
  "frontend/src/screens/AddCardScreen.tsx": "Screen for adding a new photocard to a binder with image upload, validation, preview, and progress tracking. Handles file selection, form submission, and navigation back on success.",
  "frontend/src/screens/AdminAccessDeniedScreen.tsx": "Simple access denied screen for users without admin privileges. Displays a shield alert icon and a back button to return to the library.",
  "frontend/src/screens/AdminDashboardScreen.tsx": "Main admin dashboard with tabbed interface for content management, users, layout presets, and payment settings. Protected by MasterAdminKeyGate that disables tabs until unlocked.",
  "frontend/src/screens/BinderLibraryScreen.tsx": "Main library screen displaying all user binders with create/delete actions. Enforces subscription-based binder limits (2 for free, 5 for pro) and shows upgrade prompts with Shopify integration.",
  "frontend/src/screens/BinderSettingsScreen.tsx": "Binder customization screen for editing theme properties including colors, textures, card frame styles, and background patterns. Provides color pickers and select dropdowns for theme configuration.",
  "frontend/src/screens/BinderViewScreen.tsx": "Main binder viewing screen with paginated card grid, drag-and-drop reordering, and PDF export. Supports dynamic layout configuration (e.g., 3x3 grid) and displays card overlays for condition, rarity, and glint effects.",
  "frontend/src/screens/EditCardScreen.tsx": "Canvas-based card editor for adding and manipulating stickers (decorations, rarity icons) on photocard images. Supports drag, rotate, scale, and delete operations with visual selection feedback.",
  "frontend/src/utils/backendErrorMessages.ts": "Normalizes backend errors into user-friendly messages, with special handling for binder limit errors that provides plan-specific upgrade hints.",
  "frontend/src/utils/normalizeEmail.ts": "Provides utility functions to normalize email addresses (trim and lowercase) and compare them in a case-insensitive manner.",
  "frontend/src/utils/promiseTimeout.ts": "Wraps promises with a configurable timeout (default 30s) to prevent indefinite hanging by racing against a timeout rejection.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (including binder-specific colors), animations for page flips, custom fonts (Caveat, Inter), and extended theme tokens using OKLCH color space.",
  "project_state.json": "Project state tracking two known issues: Binder View showing empty state and Admin portal Master Admin Key authentication failure, with features defined to fix these issues."
}