{
  "backend/main.mo": "Main actor defining Binder, Photocard, UserProfile, and SubscriptionStatus types with CRUD operations, admin analytics, content settings, user layout preferences, and includes MixinAuthorization and MixinStorage for access control and blob storage.",
  "backend/migration.mo": "Migration module that transforms layoutPresets from List.List<Text> to Map.Map<Text, ()> while preserving all other actor state including users, profiles, subscriptions, and settings.",
  "feature_evidence.json": "Feature evidence report documenting four requirements: fixing BinderViewScreen to apply user-selected grid layout, verifying useGetUserLayout hook, ensuring dynamic CSS Grid mapping, and verifying useUpdateUserLayout mutation with query invalidation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx with admin portal access control, useQueries.ts with fixed useGetUserLayout hook, BinderViewScreen.tsx with dynamic CSS Grid using parseInt for layout parsing, and various other screens and components for binder management and card editing.",
  "frontend/.env.example": "Example environment variables file documenting optional VITE_SHOPIFY_UPGRADE_URL and noting that Master Admin Key is now backend-only and should not be stored in frontend environment.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, defining design tokens for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag and title describing the app as a digital photocard binder with uploads, sticker editing, drag-and-drop ordering, and binder customization.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup, screen routing (library, binder, addCard, editCard, settings, admin), superuser-based admin portal access with 404 redirect for non-superusers, and global alert system.",
  "frontend/src/components/binder/BinderFrame.tsx": "Binder page frame component with spine decoration, rounded border, shadow, and background image support using admin-configured background or theme pattern with overlay texture effects.",
  "frontend/src/components/binder/BinderPageExportCanvas.tsx": "Renders a chrome-free 12-card binder page grid (1200x1600px) for export, displaying cards with condition stickers, rarity badges, glint overlays, and quantity indicators.",
  "frontend/src/components/binder/BinderPdfExportDialog.tsx": "Dialog component for exporting binder pages as GoodNotes-ready PDFs with configurable page size (A4/Letter) and quality settings (standard/high).",
  "frontend/src/components/binder/BinderRingsOverlay.tsx": "Displays a decorative binder rings overlay image positioned on the left side of the page with 40% opacity.",
  "frontend/src/components/binder/PageSwipeContainer.tsx": "Container component that handles swipe gestures for page navigation and animates page transitions with left/right flip animations.",
  "frontend/src/components/layout/AccentColorSelector.tsx": "Dropdown selector for choosing app accent colors (coral, sage, lavender, rose, teal, or default) with color preview swatches.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header containing logo, navigation, accent color selector, admin access (for superusers), profile settings, and logout functionality. Includes global alert banner support.",
  "frontend/src/components/system/GlobalLoadingGate.tsx": "Global loading and error boundary component that displays loading spinner, error alerts with retry button, or renders children based on state.",
  "frontend/src/components/terms/TermsAndConditionsDialog.tsx": "Modal dialog that fetches and displays terms and conditions content from admin settings in a scrollable area.",
  "frontend/src/config/admin.ts": "Defines superuser email allowlist and provides function to check if an email has admin portal access.",
  "frontend/src/config/buildInfo.ts": "Exports build metadata including deployment ID and timestamp for deployment tracking.",
  "frontend/src/config/subscription.ts": "Provides functions to retrieve and validate Shopify upgrade URL from environment variables for subscription management.",
  "frontend/src/features/admin/AdminUserBinderReadOnlyDialog.tsx": "Dialog component that displays a read-only view of all binders and cards for a specific user in the admin panel. Fetches user binders on open and renders them in a scrollable grid layout with card counts and thumbnails.",
  "frontend/src/features/admin/ContentManagerPanel.tsx": "Admin panel for managing site content including terms and conditions text, logo and background images with upload progress tracking, and master admin key changes. Requires unlock state to enable editing and saving functionality.",
  "frontend/src/features/admin/LayoutPresetsPanel.tsx": "Admin panel for managing grid layout presets (e.g., \"3x3\", \"4x3\") with validation, allowing addition/removal of presets and setting a default layout. Prevents removal of the currently active default layout.",
  "frontend/src/features/admin/MasterAdminKeyGate.tsx": "Authentication gate component that requires master admin key verification to unlock admin features, with automatic 30-minute inactivity timeout that tracks user activity events. Renders children with unlock state once authenticated.",
  "frontend/src/features/admin/UsersPanel.tsx": "Admin panel displaying user analytics in a table with search/filter functionality, subscription status badges, and action to view user binders. Requires unlock state for full access and includes date formatting for user timestamps.",
  "frontend/src/features/auth/LoginPanel.tsx": "Login screen component that displays branding and a button to authenticate via Internet Identity. Shows loading state during authentication and initializes the accent color theme.",
  "frontend/src/features/auth/ProfileSettingsDialog.tsx": "Dialog component for editing user profile (display name, email) and selecting layout presets, with save functionality using mutations and toast notifications.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Full-screen modal for initial user profile setup, collecting display name and optional email with a styled welcome interface.",
  "frontend/src/features/binders/theme.ts": "Exports a function that returns default theme configuration for binder appearance including colors, textures, and patterns.",
  "frontend/src/features/cards/editedImageCache.ts": "LocalStorage-based cache utilities for storing, retrieving, and clearing edited card images using data URLs.",
  "frontend/src/features/cards/imageValidation.ts": "Validates uploaded image files for type (PNG/JPEG) and size (max 10MB), returning validation results with error messages.",
  "frontend/src/features/cards/overlayAssets.ts": "Maps card condition and rarity enums to asset paths for stickers, badges, and holographic glint overlays.",
  "frontend/src/features/editor/stickerTray.ts": "Defines sticker types and loads individual sticker images from a sprite sheet for use in the card editor.",
  "frontend/src/features/export/binderPagePdf.ts": "Generates PDF exports of binder pages using browser print API, resolving card images to data URLs and building print-ready HTML.",
  "frontend/src/features/export/resolveExportImages.ts": "Converts ExternalBlob objects and edited images to data URLs for PDF export, with utilities to preload overlay assets.",
  "frontend/src/features/export/shareOrDownloadPdf.ts": "Provides filename generation for PDF exports; actual sharing/downloading is handled by browser print dialog.",
  "frontend/src/hooks/useAccentColor.ts": "Custom hook for managing app-wide accent color theme with localStorage persistence and CSS variable updates.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useBinderPagination.ts": "Custom React hook that manages pagination for photocard arrays, providing page navigation functions and current page state with configurable cards per page.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useLoadingDiagnostics.ts": "Diagnostic hook that logs detailed loading state information to console after a threshold timeout, helping debug slow app initialization without exposing sensitive data.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend canister operations including user profiles, binders, photocards, subscriptions, and admin functions with timeout handling and cache invalidation.",
  "frontend/src/hooks/useSwipeGesture.ts": "Custom hook providing touch and mouse swipe gesture detection with configurable threshold and callbacks for left/right swipe actions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom scrapbook-themed color variables in OKLCH format for light/dark modes, including binder theme colors and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/screens/AddCardScreen.tsx": "Screen component for uploading new photocards with image file validation, preview, progress tracking, and form submission to add cards to a specific binder.",
  "frontend/src/screens/AdminAccessDeniedScreen.tsx": "Displays an access denied message with a shield icon when a user without admin privileges attempts to access the admin dashboard, providing a button to return to the library.",
  "frontend/src/screens/AdminDashboardScreen.tsx": "Main admin dashboard screen with tabbed interface for Content Manager, Users, and Global Layout Options panels, protected by MasterAdminKeyGate authentication.",
  "frontend/src/screens/BinderLibraryScreen.tsx": "Displays user's binder collection with create/delete functionality, enforces subscription-based limits (2 for free, 5 for pro), and shows upgrade prompts with Shopify integration when at limit.",
  "frontend/src/screens/BinderSettingsScreen.tsx": "Provides UI for customizing binder theme settings including cover color/texture, page background, card frame style, text/accent colors, border style, and background patterns with live preview.",
  "frontend/src/screens/BinderViewScreen.tsx": "Main binder viewing screen with paginated card grid layout, drag-and-drop reordering, navigation controls, and buttons for adding cards, editing, settings, and PDF export.",
  "frontend/src/screens/EditCardScreen.tsx": "Canvas-based card editor allowing users to add, position, scale, and rotate stickers on photocard images with selection highlighting and save functionality.",
  "frontend/src/utils/backendErrorMessages.ts": "Normalizes backend errors into user-friendly messages, specifically handling binder limit errors with plan-specific upgrade hints and fallback for generic errors.",
  "frontend/src/utils/normalizeEmail.ts": "Provides email normalization (trim and lowercase) and comparison utilities for case-insensitive email matching.",
  "frontend/src/utils/promiseTimeout.ts": "Wraps promises with a configurable timeout (default 30s) to prevent indefinite hanging by racing against a timeout rejection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including binder-themed colors using OKLCH), animations for page flips, custom fonts, shadows, and border radius variables.",
  "project_state.json": "Project state tracking a fix request for BinderViewScreen component where grid layout selection (2x2, 3x3, 4x3, 5x4) is stuck at 3x3 despite user preferences."
}