{
  "kind": "build_request",
  "title": "Fix Binder View empty state and Admin portal Master Admin Key authentication",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Debug and fix the Binder View screen to correctly display photocard grids instead of showing empty state. Investigate data fetching, pagination logic, and card rendering in BinderViewScreen.tsx to identify why cards are not displaying.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "The \"Binder View\" is not working (empty)"
        ]
      },
      "acceptanceCriteria": [
        "Binder View screen displays photocard grids when binders contain cards",
        "Empty state is only shown when binder genuinely has no cards",
        "Card images, overlays, and metadata render correctly",
        "Page navigation works when multiple pages exist"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix Master Admin Key authentication in the Admin portal. Ensure MasterAdminKeyGate component correctly validates the stored master admin key from backend and grants access to admin features.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "couldn't log in to Admin portal with my Master Admin Key"
        ]
      },
      "acceptanceCriteria": [
        "Master Admin Key input correctly validates against backend-stored key",
        "Successful authentication unlocks all admin panel features",
        "Authentication persists for 30 minutes as designed",
        "Clear error messages shown for invalid or missing keys"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add error handling and logging to identify root causes of Binder View failures. Include diagnostics for data loading, query states, and render conditions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Console logs provide clear diagnostics when Binder View fails to load",
        "Error states display helpful messages to users",
        "Loading states are correctly managed during data fetching"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Verify backend query endpoints for fetching binder cards and Master Admin Key validation are functioning correctly and returning expected data structures.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Backend endpoints return cards in correct format for BinderViewScreen",
        "Master Admin Key validation logic in backend works correctly",
        "Query responses include all required fields (images, metadata, pagination)"
      ]
    }
  ],
  "constraints": [
    "Do not modify authentication flow or Internet Identity integration",
    "Preserve existing admin portal panel structure and layout",
    "Maintain 30-minute admin session timeout behavior",
    "Keep existing drag-and-drop reordering functionality intact"
  ],
  "nonGoals": [
    "Adding new admin features or panels",
    "Changing binder UI design or layout",
    "Modifying subscription or payment logic",
    "Creating new card management features"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}