{
  "kind": "build_request",
  "title": "Generate vintage-style price tag sticker PNG assets",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate 3 separate vintage-style \"Price Tag\" sticker images as transparent-background PNGs, each isolated with no shadows or background layer outside the sticker shape. Each sticker must have a slight paper texture and a small peeled corner to look like a physical sticker.\n\nText requirements per sticker:\n- Sticker 1: \"MINT\" in green\n- Sticker 2: \"NEAR MINT\" in blue\n- Sticker 3: \"PLAYED\" in orange",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Generate a set of vintage-style 'Price Tag' stickers. One says 'MINT' in green, one says 'NEAR MINT' in blue, and one says 'PLAYED' in orange. Give them a slight paper texture and a tiny bit of 'peeling' at one corner to make them look like real physical stickers. Isolated on transparent background."
        ]
      },
      "acceptanceCriteria": [
        "Three PNG files are produced, one per sticker label (MINT / NEAR MINT / PLAYED).",
        "Each PNG has a transparent background with only the sticker artwork present (no rectangular background fill).",
        "Each sticker has visible subtle paper texture and a small peeled-corner detail.",
        "Sticker text matches exactly and uses the specified text color (green/blue/orange), while maintaining a cohesive vintage price-tag style across all three."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the generated sticker PNGs to the frontend static assets under frontend/public/assets/generated and ensure they can be loaded directly by the browser via /assets/generated/<filename>.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "The three generated PNGs exist under frontend/public/assets/generated.",
        "Requesting each asset at /assets/generated/<filename> returns the image successfully in the deployed app."
      ]
    }
  ],
  "constraints": [
    "Do not add a non-transparent background; stickers must be isolated on a transparent background.",
    "Keep all user-facing text in English (MINT, NEAR MINT, PLAYED)."
  ],
  "nonGoals": [
    "Do not change backend canister logic.",
    "Do not modify the existing sticker sprite-sheet system unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [
      "Vintage price tag sticker with paper texture and small peeled corner, text \"MINT\" (price-tag-mint.dim_512x512.png)",
      "Vintage price tag sticker with paper texture and small peeled corner, text \"NEAR MINT\" (price-tag-near-mint.dim_512x512.png)",
      "Vintage price tag sticker with paper texture and small peeled corner, text \"PLAYED\" (price-tag-played.dim_512x512.png)"
    ],
    "edits": []
  }
}