{
  "kind": "build_request",
  "title": "Refine subscription handling and add Shopify-ready upgrade link",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a Shopify-ready external upgrade link for Free users and surface it in the UI anywhere binder limits are communicated (e.g., the binder limit reached alert in the binder library and the disabled “New Binder” create dialog state). The link must be configurable (no hard-coded store URL) and must open in a new tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes please, and have it link to Shopify ready"
        ]
      },
      "acceptanceCriteria": [
        "A configurable setting exists for the Shopify upgrade URL (e.g., via a single frontend config constant or environment variable) and is referenced by the UI.",
        "When a Free user is at the binder limit, the binder-limit alert includes a clear English call-to-action (e.g., “Upgrade”) that links to the configured Shopify URL.",
        "The upgrade link opens in a new tab and uses safe anchor attributes (target=\"_blank\" and rel=\"noopener noreferrer\").",
        "If the Shopify upgrade URL is not configured, the UI does not break; it should hide the upgrade CTA or show a non-clickable message indicating the link is unavailable."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve subscription/binder-limit handling UX so that errors from backend binder-limit enforcement are shown as friendly, actionable English messages rather than raw trap strings, while preserving the underlying error details for debugging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes please, and have it link to Shopify ready"
        ]
      },
      "acceptanceCriteria": [
        "If binder creation fails due to reaching the binder limit, the UI shows a user-friendly English message that references the current plan limit and suggests upgrading (for Free) or deleting a binder.",
        "Non-binder-limit errors still display a generic failure message plus any safe-to-show details (no app crash)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui). Compose these modules instead.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Implement Shopify API integration (Admin API/Storefront API), webhooks, or automatic subscription activation from Shopify purchases.",
    "Add third-party authentication providers beyond Internet Identity.",
    "Add external databases or non-IC backend components."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}