{
  "kind": "build_request",
  "title": "Add GoodNotes-ready PDF export and sharing for binder pages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a binder PDF export flow that generates a GoodNotes-friendly PDF of the currently viewed binder page (the 12-card grid) with the same visual overlays (edited image if present, rarity badge, condition sticker, and legendary glint) and without app UI chrome (no buttons/headers), suitable for import into GoodNotes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Optimise it for the ability to share and import as pdf suitable for goodnotes"
        ]
      },
      "acceptanceCriteria": [
        "From the binder view screen, the user can export the current page as a PDF file.",
        "The exported PDF page contains the 12-card layout exactly as shown (including overlays and any locally edited card images from the edited image cache).",
        "The exported PDF does not include navigation/buttons/controls (no app header/footer/back/add/settings UI).",
        "The exported PDF renders reliably (no missing images; overlays are present; no transparent/black boxes)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide export settings optimized for GoodNotes, including selectable page size (at minimum A4 Portrait and US Letter Portrait) and a high-quality output mode appropriate for handwriting/annotation (crisp text/lines and non-blurry images when zooming in within GoodNotes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Optimise it for the ability to share and import as pdf suitable for goodnotes"
        ]
      },
      "acceptanceCriteria": [
        "The user can choose between A4 Portrait and US Letter Portrait before exporting.",
        "Exported PDFs are high-resolution enough to remain clear when zoomed in within GoodNotes (no obviously pixelated layout at typical GoodNotes zoom levels).",
        "The exported layout preserves card aspect ratios and spacing and is centered on the page with consistent margins."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a \"Share\" option for the generated PDF that uses the browser’s native share mechanism when available (and falls back to downloading the PDF when sharing is not supported), so the PDF can be sent directly to GoodNotes (or saved to Files for later import).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Optimise it for the ability to share and import as pdf suitable for goodnotes"
        ]
      },
      "acceptanceCriteria": [
        "If the browser supports file sharing, the user can trigger a native share sheet with the generated PDF attached.",
        "If native sharing is unavailable, the user can still download the generated PDF file.",
        "The PDF filename is deterministic and user-friendly (includes binder name and page number)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Implementing direct GoodNotes integration APIs (GoodNotes does not provide a public import API for web apps).",
    "Adding real-time collaboration or syncing exported PDFs across devices.",
    "Backend-side PDF generation (export should be done client-side)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}