{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix binder grid layout not responding to custom selection",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the BinderViewScreen component to properly apply the user's selected grid layout (2x2, 3x3, 4x3, 5x4) instead of always displaying 3x3",
      "acceptanceCriteria": [
        "When a user selects a different grid layout from settings, the binder view immediately reflects the new grid dimensions",
        "The grid layout persists correctly across page navigations and browser refreshes",
        "All grid options (2x2, 3x3, 4x3, 5x4) render with correct column and row counts"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/BinderViewScreen.tsx",
          "operation": "modify",
          "description": "Fix the grid template CSS generation to properly map layout presets to CSS Grid values. Update the component to use the layout value from useGetUserLayout hook instead of hardcoded 3x3. Ensure the grid-template-columns and grid-template-rows are dynamically set based on the actual layout string (e.g., '2x2' -> 'repeat(2, 1fr)' columns and 'repeat(2, 1fr)' rows). Add proper parsing logic to extract rows and columns from the layout string format."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Verify that useGetUserLayout hook correctly fetches and returns the current user's layout preference",
      "acceptanceCriteria": [
        "The useGetUserLayout hook successfully retrieves the user's saved layout from backend",
        "Layout changes made in ProfileSettingsDialog are immediately reflected in the hook's return value",
        "Hook properly handles loading and error states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useGetUserLayout hook implementation to ensure it correctly calls the backend getUserLayout method with the authenticated caller's principal. Verify the query key is unique and properly structured. Ensure the hook is enabled only when the actor is available and the user is authenticated. Add proper error handling for cases where the layout cannot be fetched."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the dynamic CSS Grid implementation in BinderViewScreen correctly maps layout preset strings to grid-template-columns and grid-template-rows values",
      "acceptanceCriteria": [
        "Layout preset '2x2' correctly applies 2 columns and 2 rows",
        "Layout preset '3x3' correctly applies 3 columns and 3 rows",
        "Layout preset '4x3' correctly applies 4 columns and 3 rows",
        "Layout preset '5x4' correctly applies 5 columns and 4 rows",
        "Cards are positioned correctly within the grid for each layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/BinderViewScreen.tsx",
          "operation": "modify",
          "description": "Implement a helper function that parses layout strings (format 'COLSxROWS') and returns an object with columns and rows values. Apply these values to the grid container's inline styles using grid-template-columns: repeat(cols, 1fr) and grid-template-rows: repeat(rows, 1fr). Ensure the grid gap and card sizing adapt correctly to different layouts. Test all four layout presets to verify correct rendering."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Verify that useUpdateUserLayout mutation successfully saves the selected layout to the backend and invalidates relevant queries",
      "acceptanceCriteria": [
        "When a user selects a new layout in ProfileSettingsDialog, the mutation successfully updates the backend",
        "After successful update, the useGetUserLayout query is invalidated and refetches",
        "Error states from the mutation are properly handled and displayed to the user"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useUpdateUserLayout mutation hook to ensure it correctly calls the backend updateUserLayout method with the new layout value. Add proper onSuccess callback that invalidates the 'userLayout' query key to trigger a refetch. Ensure the mutation includes proper error handling and returns meaningful error messages to the UI."
        },
        {
          "path": "frontend/src/features/auth/ProfileSettingsDialog.tsx",
          "operation": "modify",
          "description": "Verify that the layout selection dropdown correctly passes the selected layout value to the useUpdateUserLayout mutation. Ensure the mutation's loading and error states are properly displayed to the user. Add visual feedback (success toast or indication) when the layout is successfully updated. Confirm that the dialog shows the current layout as selected when opened."
        }
      ]
    }
  ]
}