{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Binder View empty state and Admin portal Master Admin Key authentication",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Debug and fix the Binder View screen to correctly display photocard grids instead of showing empty state",
      "acceptanceCriteria": [
        "Binder View screen displays photocard grids when binders contain cards",
        "Empty state is only shown when binder genuinely has no cards",
        "Card images, overlays, and metadata render correctly",
        "Page navigation works when multiple pages exist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/BinderViewScreen.tsx",
          "operation": "modify",
          "description": "Add comprehensive diagnostic logging to identify why cards are not rendering. Log the raw binders data from useGetBinders query, the selectedBinder object, cards array length, currentPageCards from useBinderPagination, and rendering conditions. Add error boundaries and loading state checks. Verify that cards.length > 0 condition correctly determines when to show the grid vs empty state. Ensure the DndContext and card mapping logic executes when cards exist."
        },
        {
          "path": "frontend/src/hooks/useBinderPagination.ts",
          "operation": "modify",
          "description": "Add console logging to track pagination calculations: log cardsPerPage value, totalPages calculation, currentPage state, and the currentPageCards slice operation. Verify that the slice indices are correct and that cards are not being filtered out incorrectly. Log when page boundaries are hit to ensure navigation logic works correctly."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add diagnostic logging to useGetBinders hook to track query status, data fetching progress, and the structure of returned binder data. Log when the query succeeds, the number of binders returned, and a sample of card data structure. Add timeout error handling and verify that promiseTimeout is not prematurely terminating requests. Ensure cards array within each binder is properly populated."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix Master Admin Key authentication in the Admin portal to correctly validate stored key and grant access",
      "acceptanceCriteria": [
        "Master Admin Key input correctly validates against backend-stored key",
        "Successful authentication unlocks all admin panel features",
        "Authentication persists for 30 minutes as designed",
        "Clear error messages shown for invalid or missing keys"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/MasterAdminKeyGate.tsx",
          "operation": "modify",
          "description": "Debug the key validation flow by adding detailed logging: log when getMasterAdminKey is called, the retrieved key value (masked for security), the user-submitted key (masked), and the comparison result. Verify the string comparison logic handles null/undefined cases correctly. Add error handling for backend query failures. Log the unlock state changes and session timeout behavior. Ensure the 30-minute inactivity timer correctly tracks user activity and maintains the unlocked state."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add diagnostic logging to useGetMasterAdminKey hook to verify the backend query executes correctly and returns the expected key format. Log query status, loading states, and any errors. Ensure the actor is properly initialized before calling getMasterAdminKey. Add retry logic if the query fails due to network issues."
        },
        {
          "path": "frontend/src/screens/AdminDashboardScreen.tsx",
          "operation": "modify",
          "description": "Add logging to track when MasterAdminKeyGate mounts, when it grants access, and when tabs become enabled. Verify that the unlocked prop correctly propagates to child panels (ContentManagerPanel, UsersPanel, LayoutPresetsPanel, PaymentSettingsPanel). Log any rendering issues that might prevent admin features from displaying after successful authentication."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add error handling and logging to identify root causes of Binder View failures with clear diagnostics",
      "acceptanceCriteria": [
        "Console logs provide clear diagnostics when Binder View fails to load",
        "Error states display helpful messages to users",
        "Loading states are correctly managed during data fetching"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/BinderViewScreen.tsx",
          "operation": "modify",
          "description": "Wrap the main rendering logic in error boundaries with try-catch blocks. Add user-friendly error messages that display when data fetching fails, when selectedBinder is undefined, or when card rendering fails. Show loading spinner with status text during data fetching. Add a retry button that refetches binders data. Log all error objects with full stack traces to console for debugging."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Enhance error handling in useGetBinders query with structured error logging. Log query lifecycle events: initiated, pending, success, error. Capture and log specific error types (network failures, timeout, backend errors). Ensure error messages are exposed to consuming components for display to users."
        },
        {
          "path": "frontend/src/components/system/GlobalLoadingGate.tsx",
          "operation": "modify",
          "description": "Add enhanced error state rendering that displays specific error messages rather than generic text. Include component stack information in error logs. Add a detailed retry mechanism that logs retry attempts. Ensure loading states correctly reflect the status of all dependent queries (actor, profile, binders)."
        },
        {
          "path": "frontend/src/hooks/useLoadingDiagnostics.ts",
          "operation": "modify",
          "description": "Lower the diagnostic threshold or add more granular logging to capture loading bottlenecks earlier. Log the status of actor initialization, profile fetching, and binders query separately with timestamps. Add warnings when any step exceeds expected duration. Ensure diagnostics help identify which specific step is blocking the Binder View screen from loading."
        }
      ]
    }
  ]
}