{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Vintage price tag sticker PNG assets (transparent)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Generate three vintage-style price-tag sticker PNGs (transparent background) with specified labels and colors.",
      "acceptanceCriteria": [
        "Three PNG files are produced, one per sticker label (MINT / NEAR MINT / PLAYED).",
        "Each PNG has a transparent background with only the sticker artwork present (no rectangular background fill).",
        "Each sticker has visible subtle paper texture and a small peeled-corner detail.",
        "Sticker text matches exactly and uses the specified text color (green/blue/orange), while maintaining a cohesive vintage price-tag style across all three."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/price-tag-mint.dim_512x512.png",
          "operation": "create",
          "description": "Add generated transparent PNG asset for vintage price tag sticker with subtle paper texture and a small peeled corner; text reads exactly \"MINT\" in green; no shadows/background outside sticker shape."
        },
        {
          "path": "frontend/public/assets/generated/price-tag-near-mint.dim_512x512.png",
          "operation": "create",
          "description": "Add generated transparent PNG asset for vintage price tag sticker with subtle paper texture and a small peeled corner; text reads exactly \"NEAR MINT\" in blue; no shadows/background outside sticker shape."
        },
        {
          "path": "frontend/public/assets/generated/price-tag-played.dim_512x512.png",
          "operation": "create",
          "description": "Add generated transparent PNG asset for vintage price tag sticker with subtle paper texture and a small peeled corner; text reads exactly \"PLAYED\" in orange; no shadows/background outside sticker shape."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Place the generated sticker PNGs under frontend/public/assets/generated so they are directly accessible via /assets/generated/<filename>.",
      "acceptanceCriteria": [
        "The three generated PNGs exist under frontend/public/assets/generated.",
        "Requesting each asset at /assets/generated/<filename> returns the image successfully in the deployed app."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/README.generated-assets.txt",
          "operation": "create",
          "description": "Document the expected direct browser paths for the generated assets to validate static serving: /assets/generated/price-tag-mint.dim_512x512.png, /assets/generated/price-tag-near-mint.dim_512x512.png, /assets/generated/price-tag-played.dim_512x512.png."
        }
      ]
    }
  ]
}